sysbench/test_partition_global.log
do sysbench oltp_point_select, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 135740.65 qps: 135740.65 (r/w/o: 135740.65/0.00/0.00) lat (ms,95%): 0.62 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 143150.79 qps: 143150.79 (r/w/o: 143150.79/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 143229.59 qps: 143229.59 (r/w/o: 143229.59/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 143667.58 qps: 143667.58 (r/w/o: 143667.58/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 143262.46 qps: 143262.56 (r/w/o: 143262.56/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 144364.65 qps: 144364.55 (r/w/o: 144364.55/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 144693.66 qps: 144693.66 (r/w/o: 144693.66/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 143977.71 qps: 143977.71 (r/w/o: 143977.71/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 143350.48 qps: 143350.48 (r/w/o: 143350.48/0.00/0.00) lat (ms,95%): 0.58 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 145427.69 qps: 145427.69 (r/w/o: 145427.69/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 145159.24 qps: 145159.24 (r/w/o: 145159.24/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 145346.11 qps: 145346.11 (r/w/o: 145346.11/0.00/0.00) lat (ms,95%): 0.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            17213997
        write:                           0
        other:                           0
        total:                           17213997
    transactions:                        17213997 (143440.54 per sec.)
    queries:                             17213997 (143440.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0066s
    total number of events:              17213997

Latency (ms):
         min:                                    0.23
         avg:                                    0.45
         max:                                   19.01
         95th percentile:                        0.58
         sum:                              7670589.11

Threads fairness:
    events (avg/stddev):           268968.7031/1928.27
    execution time (avg/stddev):   119.8530/0.00

do sysbench oltp_point_select, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 242594.76 qps: 242594.76 (r/w/o: 242594.76/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 243972.19 qps: 243972.19 (r/w/o: 243972.19/0.00/0.00) lat (ms,95%): 0.78 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 241357.58 qps: 241357.58 (r/w/o: 241357.58/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 238299.21 qps: 238299.21 (r/w/o: 238299.21/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 241896.88 qps: 241896.88 (r/w/o: 241896.88/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 240861.34 qps: 240861.34 (r/w/o: 240861.34/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 242407.45 qps: 242407.45 (r/w/o: 242407.45/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 240855.17 qps: 240855.17 (r/w/o: 240855.17/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 237724.27 qps: 237724.27 (r/w/o: 237724.27/0.00/0.00) lat (ms,95%): 0.83 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 238154.56 qps: 238154.56 (r/w/o: 238154.56/0.00/0.00) lat (ms,95%): 0.81 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 242069.30 qps: 242069.30 (r/w/o: 242069.30/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 240249.08 qps: 240249.08 (r/w/o: 240249.08/0.00/0.00) lat (ms,95%): 0.80 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            28904962
        write:                           0
        other:                           0
        total:                           28904962
    transactions:                        28904962 (240842.22 per sec.)
    queries:                             28904962 (240842.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0148s
    total number of events:              28904962

Latency (ms):
         min:                                    0.22
         avg:                                    0.53
         max:                                   11.20
         95th percentile:                        0.80
         sum:                             15343508.80

Threads fairness:
    events (avg/stddev):           225820.0156/2963.37
    execution time (avg/stddev):   119.8712/0.00

do sysbench select_random_ranges, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 48288.49 qps: 48288.49 (r/w/o: 48288.49/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 48541.38 qps: 48541.38 (r/w/o: 48541.38/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 47940.50 qps: 47940.50 (r/w/o: 47940.50/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 48046.16 qps: 48046.16 (r/w/o: 48046.16/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 48377.47 qps: 48377.47 (r/w/o: 48377.47/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 47758.73 qps: 47758.73 (r/w/o: 47758.73/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 47979.49 qps: 47979.49 (r/w/o: 47979.49/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 47329.50 qps: 47329.50 (r/w/o: 47329.50/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 47742.63 qps: 47742.63 (r/w/o: 47742.63/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 48234.17 qps: 48234.17 (r/w/o: 48234.17/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 47698.83 qps: 47698.83 (r/w/o: 47698.83/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 47842.42 qps: 47842.42 (r/w/o: 47842.42/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5757937
        write:                           0
        other:                           0
        total:                           5757937
    transactions:                        5757937 (47977.05 per sec.)
    queries:                             5757937 (47977.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0131s
    total number of events:              5757937

Latency (ms):
         min:                                    0.28
         avg:                                    1.33
         max:                                   76.04
         95th percentile:                        2.57
         sum:                              7671865.02

Threads fairness:
    events (avg/stddev):           89967.7656/47976.24
    execution time (avg/stddev):   119.8729/0.06

do sysbench select_random_ranges, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 56765.93 qps: 56766.03 (r/w/o: 56766.03/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 56612.05 qps: 56612.15 (r/w/o: 56612.15/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 56929.70 qps: 56929.50 (r/w/o: 56929.50/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 56988.57 qps: 56988.57 (r/w/o: 56988.57/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 56956.13 qps: 56956.13 (r/w/o: 56956.13/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 58210.50 qps: 58210.50 (r/w/o: 58210.50/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 57842.87 qps: 57842.87 (r/w/o: 57842.87/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 57933.60 qps: 57933.60 (r/w/o: 57933.60/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 56854.48 qps: 56854.48 (r/w/o: 56854.48/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 57084.28 qps: 57084.28 (r/w/o: 57084.28/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 57222.29 qps: 57222.29 (r/w/o: 57222.29/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 57125.53 qps: 57125.53 (r/w/o: 57125.53/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6865483
        write:                           0
        other:                           0
        total:                           6865483
    transactions:                        6865483 (57202.49 per sec.)
    queries:                             6865483 (57202.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0194s
    total number of events:              6865483

Latency (ms):
         min:                                    0.28
         avg:                                    2.24
         max:                                   85.73
         95th percentile:                        5.37
         sum:                             15349355.55

Threads fairness:
    events (avg/stddev):           53636.5859/24350.96
    execution time (avg/stddev):   119.9168/0.03

do sysbench oltp_update_non_index, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 18148.85 qps: 18148.85 (r/w/o: 0.00/18148.85/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 17958.44 qps: 17958.44 (r/w/o: 0.00/17958.44/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 17776.30 qps: 17776.30 (r/w/o: 0.00/17776.30/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 17967.76 qps: 17967.76 (r/w/o: 0.00/17967.76/0.00) lat (ms,95%): 4.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 18403.20 qps: 18403.20 (r/w/o: 0.00/18403.20/0.00) lat (ms,95%): 4.49 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 17800.55 qps: 17800.55 (r/w/o: 0.00/17800.55/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 16849.07 qps: 16849.07 (r/w/o: 0.00/16849.07/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 16981.41 qps: 16981.41 (r/w/o: 0.00/16981.41/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 17330.93 qps: 17330.93 (r/w/o: 0.00/17330.93/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 16177.84 qps: 16177.84 (r/w/o: 0.00/16177.84/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 17237.94 qps: 17237.94 (r/w/o: 0.00/17237.94/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 17443.89 qps: 17443.89 (r/w/o: 0.00/17443.89/0.00) lat (ms,95%): 4.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2100856
        other:                           0
        total:                           2100856
    transactions:                        2100856 (17505.63 per sec.)
    queries:                             2100856 (17505.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0090s
    total number of events:              2100856

Latency (ms):
         min:                                    1.53
         avg:                                    3.65
         max:                                   41.02
         95th percentile:                        4.82
         sum:                              7678187.47

Threads fairness:
    events (avg/stddev):           32825.8750/38.95
    execution time (avg/stddev):   119.9717/0.00

do sysbench oltp_update_non_index, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 32842.32 qps: 32842.32 (r/w/o: 0.00/32842.32/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 31722.32 qps: 31722.32 (r/w/o: 0.00/31722.32/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 31487.33 qps: 31487.33 (r/w/o: 0.00/31487.33/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 32708.12 qps: 32708.12 (r/w/o: 0.00/32708.12/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 32852.51 qps: 32852.51 (r/w/o: 0.00/32852.51/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 32998.85 qps: 32998.85 (r/w/o: 0.00/32998.85/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 33213.87 qps: 33213.87 (r/w/o: 0.00/33213.87/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 33249.35 qps: 33249.35 (r/w/o: 0.00/33249.35/0.00) lat (ms,95%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 31441.66 qps: 31441.66 (r/w/o: 0.00/31441.66/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 32905.48 qps: 32905.48 (r/w/o: 0.00/32905.48/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 29131.39 qps: 29131.39 (r/w/o: 0.00/29131.39/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 33068.85 qps: 33068.85 (r/w/o: 0.00/33068.85/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3876403
        other:                           0
        total:                           3876403
    transactions:                        3876403 (32298.41 per sec.)
    queries:                             3876403 (32298.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0171s
    total number of events:              3876403

Latency (ms):
         min:                                    1.64
         avg:                                    3.96
         max:                                   21.17
         95th percentile:                        5.28
         sum:                             15356995.45

Threads fairness:
    events (avg/stddev):           30284.3984/31.23
    execution time (avg/stddev):   119.9765/0.00

do sysbench oltp_update_index, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 13303.20 qps: 13303.20 (r/w/o: 0.00/13303.20/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 13752.05 qps: 13752.05 (r/w/o: 0.00/13752.05/0.00) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 13099.59 qps: 13099.59 (r/w/o: 0.00/13099.59/0.00) lat (ms,95%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 13580.07 qps: 13580.07 (r/w/o: 0.00/13580.07/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 13601.45 qps: 13601.45 (r/w/o: 0.00/13601.45/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 13582.17 qps: 13582.17 (r/w/o: 0.00/13582.17/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 11986.08 qps: 11986.08 (r/w/o: 0.00/11986.08/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 12628.37 qps: 12628.37 (r/w/o: 0.00/12628.37/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 12688.57 qps: 12688.57 (r/w/o: 0.00/12688.57/0.00) lat (ms,95%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 12995.91 qps: 12995.91 (r/w/o: 0.00/12995.91/0.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 12134.54 qps: 12134.54 (r/w/o: 0.00/12134.54/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 12457.17 qps: 12457.17 (r/w/o: 0.00/12457.17/0.00) lat (ms,95%): 7.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1558175
        other:                           0
        total:                           1558175
    transactions:                        1558175 (12983.63 per sec.)
    queries:                             1558175 (12983.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0094s
    total number of events:              1558175

Latency (ms):
         min:                                    1.94
         avg:                                    4.93
         max:                                   44.73
         95th percentile:                        6.67
         sum:                              7678730.12

Threads fairness:
    events (avg/stddev):           24346.4844/39.70
    execution time (avg/stddev):   119.9802/0.00

do sysbench oltp_update_index, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 22678.95 qps: 22678.95 (r/w/o: 0.00/22678.95/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 22333.74 qps: 22333.74 (r/w/o: 0.00/22333.74/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 22290.59 qps: 22290.59 (r/w/o: 0.00/22290.59/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 22691.23 qps: 22691.23 (r/w/o: 0.00/22691.23/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 22336.20 qps: 22336.20 (r/w/o: 0.00/22336.20/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 21275.50 qps: 21275.50 (r/w/o: 0.00/21275.50/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 22673.61 qps: 22673.61 (r/w/o: 0.00/22673.61/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 22786.60 qps: 22786.60 (r/w/o: 0.00/22786.60/0.00) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 22193.86 qps: 22193.86 (r/w/o: 0.00/22193.86/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 15805.23 qps: 15805.23 (r/w/o: 0.00/15805.23/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 16856.47 qps: 16856.47 (r/w/o: 0.00/16856.47/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 19064.94 qps: 19064.94 (r/w/o: 0.00/19064.94/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2530027
        other:                           0
        total:                           2530027
    transactions:                        2530027 (21080.67 per sec.)
    queries:                             2530027 (21080.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0151s
    total number of events:              2530027

Latency (ms):
         min:                                    2.17
         avg:                                    6.07
         max:                                   48.48
         95th percentile:                        9.06
         sum:                             15358319.02

Threads fairness:
    events (avg/stddev):           19765.8359/32.27
    execution time (avg/stddev):   119.9869/0.00

do sysbench oltp_insert, thread=64
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 64 tps: 13393.11 qps: 13393.11 (r/w/o: 0.00/13393.11/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 64 tps: 13221.48 qps: 13221.48 (r/w/o: 0.00/13221.48/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 64 tps: 13187.96 qps: 13187.96 (r/w/o: 0.00/13187.96/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 13387.79 qps: 13387.79 (r/w/o: 0.00/13387.79/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 64 tps: 12940.89 qps: 12940.89 (r/w/o: 0.00/12940.89/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 12839.92 qps: 12839.92 (r/w/o: 0.00/12839.92/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 64 tps: 13107.58 qps: 13107.58 (r/w/o: 0.00/13107.58/0.00) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 64 tps: 13020.77 qps: 13020.77 (r/w/o: 0.00/13020.77/0.00) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 12781.71 qps: 12781.71 (r/w/o: 0.00/12781.71/0.00) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 64 tps: 12792.30 qps: 12792.30 (r/w/o: 0.00/12792.30/0.00) lat (ms,95%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 64 tps: 12322.94 qps: 12322.94 (r/w/o: 0.00/12322.94/0.00) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 13272.45 qps: 13272.45 (r/w/o: 0.00/13272.45/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1562775
        other:                           0
        total:                           1562775
    transactions:                        1562775 (13022.05 per sec.)
    queries:                             1562775 (13022.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0086s
    total number of events:              1562775

Latency (ms):
         min:                                    1.97
         avg:                                    4.91
         max:                                   32.53
         95th percentile:                        6.21
         sum:                              7674803.81

Threads fairness:
    events (avg/stddev):           24418.3594/30.65
    execution time (avg/stddev):   119.9188/0.00

do sysbench oltp_insert, thread=128
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 21657.47 qps: 21657.47 (r/w/o: 0.00/21657.47/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 15191.70 qps: 15191.80 (r/w/o: 0.00/15191.80/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 21663.84 qps: 21663.74 (r/w/o: 0.00/21663.74/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 21708.19 qps: 21708.19 (r/w/o: 0.00/21708.19/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 21692.58 qps: 21692.58 (r/w/o: 0.00/21692.58/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 21248.78 qps: 21248.78 (r/w/o: 0.00/21248.78/0.00) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 128 tps: 22092.27 qps: 22092.27 (r/w/o: 0.00/22092.27/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 128 tps: 21832.39 qps: 21832.39 (r/w/o: 0.00/21832.39/0.00) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 20200.49 qps: 20200.49 (r/w/o: 0.00/20200.49/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 128 tps: 19775.73 qps: 19775.73 (r/w/o: 0.00/19775.73/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 128 tps: 20872.22 qps: 20872.22 (r/w/o: 0.00/20872.22/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 19960.65 qps: 19960.65 (r/w/o: 0.00/19960.65/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           2479128
        other:                           0
        total:                           2479128
    transactions:                        2479128 (20655.94 per sec.)
    queries:                             2479128 (20655.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0188s
    total number of events:              2479128

Latency (ms):
         min:                                    2.01
         avg:                                    6.19
         max:                                   71.14
         95th percentile:                        8.58
         sum:                             15352051.72

Threads fairness:
    events (avg/stddev):           19368.1875/30.05
    execution time (avg/stddev):   119.9379/0.00